{
  "easy": "Okay, listen up—tonight was wild. The Dodgers played the Brewers, and the stadium was loud and bright. I was like, “No way this is real,” but it was. The score at the end was 5 to 1. The Dodgers won, and everyone was jumping and cheering.\n\nThe biggest star was Shohei Ohtani. He hit the ball so hard it flew and flew—home run! People stood up and yelled. Then he hit another home run. And then, I’m serious, a third one. Three home runs in one game. I was screaming and covering my mouth like, “OMG.” It felt like a movie.\n\nBut that’s not all. Shohei also pitched. He threw fast, smart, beautiful strikes. The other team kept missing. We counted the strikeouts out loud—one, two, three—until he reached ten. Ten! I high-fived a stranger. It was that kind of night.\n\nThe Dodgers got early runs and kept control. The infield grabbed grounders clean. The outfield caught big fly balls. The pitcher after Shohei kept it calm. Every inning, the whole team stayed focused. The Brewers scored only one run, and the Dodgers just kept moving, step by step, toward the last out.\n\nWhen that last out happened, the crowd was a blue wave. I almost cried a little, not gonna lie. The Dodgers swept the series—won all four games—and now they go to the World Series. And Shohei? He was named the MVP of the series. He earned it, for sure.\n\nIf you missed the game, don’t worry. Just remember this: three home runs, ten strikeouts, five to one, and a stadium full of happy people. Tonight felt like hope with fireworks. The Dodgers are on to the next big stage, and I cannot wait. Let’s go!",
  "standard": "So, the whole night had that “something’s about to happen” energy. Dodgers vs. Brewers, lights slicing the sky, everyone restless. And then Shohei walks up and basically turns baseball into a TikTok you can’t scroll away from. First blast—gone. Stadium snaps from loud to louder. Next time up—again. The launch angle was so clean my physics teacher would’ve used it as a slide. Third time—no doubt. By the third homer I was high-fiving people I’ve never met. Baseball is funny like that: strangers become your hype squad.\n\nBut the two-way part is what scrambles your brain. On the mound, Shohei set the tempo like a DJ—fastball up, something nasty running off the plate, and hitters just… late. The strikeout total rolls to double digits (10), and you can feel the Brewers’ timing fall out of sync. Meanwhile the Dodgers’ defense is crisp, turning tough hops into boring outs, and the lineup stacks enough runs to keep the stress level reasonable. The final reads 5–1, but it felt more controlled than the numbers even say.\n\nZoom out and it’s bigger than a single win. This was Game 4 of the NLCS, and the Dodgers didn’t just win—they swept. When the last out settled, the place turned into one giant blue heartbeat. Shohei gets NLCS MVP, obviously, because how else do you describe three homers and ten Ks in the same game without handing over hardware?\n\nNow they’re headed to the World Series, four wins from back-to-back titles. I’m trying to be cool about it, but honestly? I’m not. I’m already picking lucky hoodies for Friday. Nights like this are why you sit through all the random Tuesdays in April. Sometimes the game gives you something you’ll tell your kids about. This was one of those nights.",
  "hard": "Under October lights that felt more like stage cues than illumination, the Dodgers didn’t merely beat Milwaukee; they imposed a rhythm. The night’s grammar was written by Shohei Ohtani, who authored three exclamation points to center and left and then, with almost unfair symmetry, punctuated the same game from the mound—ten strikeouts, pace immaculate, miss-inducing movement like sleight of hand. The line 5–1 reads tidy; the experience felt inevitable.\n\nThis was Game 4, the closing chapter of a sweep, and yet the performance refused to shrink to its box score. Ohtani kept toggling modes—slugger, sculptor—like a bilingual speaker switching tongues mid-sentence, each choice precise to the moment. The Brewers pressed, but the Dodgers’ defense deflated rallies with the indifferent efficiency of a well-rehearsed stage crew. By the final out, the stadium had become a tuning fork, humming on a single note: World Series.\n\nAwards can lag behind memory, but not tonight. NLCS MVP landed where it had to, acknowledging the kind of two-way dominance that collapses debate. If postseason baseball is a test of adjustments, this was the answer key printed in bold. Three moonshots to tilt the geometry, ten Ks to edit the oxygen, composure throughout to keep the story legible.\n\nWhat’s left is the horizon. The Dodgers step toward a title defense, not as passengers of momentum but as its engineers. The sweep isn’t a flourish; it’s an argument. And the most persuasive paragraph was written by a player who refused to be contained by a single verb—hit or pitch—when the moment asked for both. October doesn’t hand out certainties, but it does grant tone. Tonight’s felt like blue ink drying on a new chapter."
}