{
  "easy": "It is a bright day in April. The clocks say thirteen. The class is quiet. We sit at our desks. We look at the screen. There is a play button. We press the button. A voice starts. It is clear and slow. We listen and follow.\n\nWe read one word at a time. We do not hurry. We breathe. If we miss a sound, we stop. We try again. Step by step, we get better.\n\nThe room is calm. Light comes in from the window. A bus goes by outside. We hear a small bird. Time moves like a slow river. We do not rush.\n\nWe say easy words first. We say “a”, “the”, “and”, “is”. Then we say short verbs: “go”, “come”, “see”, “make”, “like”. We join words to make short lines. We read, we listen, we speak.\n\nSome words are hard. That is okay. We pause and try again. We shape the sound with our mouth. We open our mouth for “a”. We smile a little for “i”. We touch our top teeth for “f”. We feel the air for “th”.\n\nWe follow the voice. The voice is our guide. We keep the same beat. Like walking, left foot, right foot. One step, then one more. One word, then one more.\n\nThe teacher nods. We nod too. We do not need to be perfect. We only need to try. Small steps make a long road. Today we take small steps. That is enough.\n\nWe read short lines about a day. The sky is blue. The air is cold. We hold a book. We turn a page. The page is light in our hand.\n\nWe say a full sentence now. \n“It is a bright day in April.” \n“The classroom is quiet.” \n“We press play and speak with the voice.” \nWe can say these lines. We can say them well.\n\nNear the end, we slow down. We breathe in and breathe out. We read the last line with care. We stop and smile. We feel a little proud. We know what to do next.\n\nWe press play again. We listen again. We speak again. A little stronger, a little clearer. Day by day, our words grow. Step by step, English becomes our friend.",
  "standard": "It was a bright, cold day in April, and the clocks were striking thirteen. The classroom settled into a careful quiet, the kind born not of fear but of focus. We pressed play, and a steady voice unfurled like a ribbon down the page. We followed word by word, letting the rhythm guide our breath. Some syllables were smooth as glass; others had grit that caught on the tongue. We didn’t hurry. We adjusted, tried again, and let the sentence land.\n\nShadowing, the text reminded us, is ordinary courage: showing up, repeating, refining. Progress often hides in plain sight, like a seed rooting under dark soil. You won’t hear trumpets. You will feel a new ease when a sound you once dodged suddenly fits. The ear is the patient teacher; the mouth is the late student who eventually arrives.\n\nOutside, a bus exhaled at the curb and pulled away. Sunlight counted tiles across the floor. Someone coughed, then settled. We borrowed the speaker’s cadence, and our scattered timing knit itself into a single pulse. A tricky cluster returned—r after a consonant, a th that wanted to escape—but we met it without drama, pinning it gently in place.\n\nMidway through, the passage painted an evening after rain. Streetlights lifted their halos. Sidewalks carried rumors of footsteps. Windows practiced their soft theater for anyone who cared to watch. We read into the mood and let our voices pick up the hush. Not imitation, exactly—more like harmonizing with a melody we were learning to trust.\n\nIn the final paragraph, the voice grew deliberate, as if setting a lantern on each word. Believe in rhythm when you can’t believe in skill. Believe in breath when rhythm deserts you. And when breath is all you have, let it be enough for one more line. We reached the period together. The room felt unchanged and kinder. We looked up, surprised by our own sound. It wasn’t flawless. It was ours, and it was moving forward.",
  "hard": "On a lucid yet frigid April morning, the clocks insisted upon thirteen, and the hour trembled with a faint sense of misalignment. In the room, silence spread like varnish, deliberate and thin. We depressed the button, and a voice—tempered, unhurried—spiraled outward. We pursued it with deliberate fidelity, harvesting consonants, calibrating vowels, and tolerating the friction that arises wherever articulation and ambition collide.\n\nShadowing, the passage proposed, is a discipline of increments. No revelation descends; instead, there is an accretion of micro-adjustments—a millimeter of jaw, a degree of tongue, an ounce of breath. The progress is almost subcutaneous, a quiet osmosis by which unfamiliar phonemes acquire residency. The ear becomes curator; the mouth follows as apprentice, sanding roughness from each attempted contour.\n\nBeyond the windows, the city rehearsed its minor symphony: a bus releasing compressed air, a bicycle chain engaging, a newspaper loosened from its twine. Sunlight traversed the floor in precise tessellations, as if auditioning for geometry. Inside, our tempo converged. The difficult cluster returned—a consonant labyrinth that previously undid us—but we resisted melodrama and pursued exactitude. We allowed the cadence to act as metronome and map.\n\nMidway, the text drifted toward images of evening after rain. Sodium lamps coronated intersections; gutters ferried miniature constellations of reflected light. Apartments conversed in murmurs through half-drawn curtains. We matched that atmosphere with restraint, letting sentences land without spectacle. Accuracy first, then ornament, the voice seemed to counsel.\n\nToward the end, the narration acquired a lucid gravitas. Believe in rhythm when competence wavers. Believe in breath when rhythm thins. And if breath is the last currency, spend it on a single clean line. We approached the terminus with an almost liturgical care, each word set down like a measured stone. Finishing did not feel like triumph so much as alignment: the mouth, at last, cooperating with the ear; the hour, though still labeled thirteen, somehow reconciled with time. We exhaled, not victorious but prepared—for repetition, for refinement, for the quiet work that makes tomorrow sound less foreign than today."
}